; 注意：此配置文件必须采用 UTF-16LE 编码
;
; 此文件用于展示"快捷键"配置文件的结构，便于自定义快捷键
; 可以在每个工作台内单独配置快捷键，也可以在"[通用]"内配置全局生效的快捷键
;
; 推荐使用 command-id 来调用命令，调用更精确
; command-id 可通过'工作间呈示'命令，在输出的数据中找到
; 
; 举例：在'工作间呈示'命令输出的文件里可能有如下字段
;
; Title= 草图
;    Id 	= CATMmrSketchHeaderHdr
;    DLL 	= CATSkuBase
;    Cmd 	= CATComDYSInitForPRT
;    Arg 	= 
;    State Initial	= 1
;    State Current	= 1
;
; "Id" 字段的值"CATMmrSketchHeaderHdr"就是"草图"需要调用的命令

[通用]
F2 = CATAfrOpenPropertyHdr              ; 属性
F6 = 隐藏其他
F9 = 可拾取的低亮度背景...
F10 = SpecificationsLevel1          ;全部折叠
!D = CATMmrSetCurrentFeatureCSOHdr      ; 定义工作对象
!Q = CATAfrSeeShownHdr                  ; 交换可视空间
!1 = CATAfrSwapHideShowHdr              ; 隐藏/显示
!m = 应用材料
!l = 目录浏览器
^+!s = CATAfrFileSaveAllAsHdr           ; 保存管理
^+s = CATAfrFileSaveAsHdr               ; 另存为...
^w = CATAfrFileCloseHdr                 ; 关闭
^!S = 带边着色但不光顺边线
^!D = CATAfrCustomerViewOptionHdr       ; 应用自定义的视图
^!R = CATAfrShadingWithTextureAndEdgesHdr          ;含材料和边线着色
^+!R = CATAfrShadingWithTextureHdr          ;含材料着色
^!W = CATAfrNhrHdr                      ; 线框 (NHR)
^T = CAT2DQuickTrimHdr                  ; 快速修剪
^+V = CATAfrPasteSpecialHdr             ; 选择性粘贴...
^D = CATAfrDeleteHdr                    ; 删除

[装配设计]
^A = 所有
F7 = AsmSpaceSection                    ; 切割

[产品结构]
F7 = AsmSpaceSection                    ; 切割

[FLOEFD - Engineering Fluid Dynamics]

[零件设计]
^!h = 仅当前几何体
F7 = DynamicSectioningHeader                 ; 动态切割
F11 = CATShapeDesignInsertMode             ; 插入模式
^1 = USTHPoint                          ; 点过滤器
^2 = USTHCurve                          ; 曲线过滤器
^3 = USTHSurface                        ; 曲面过滤器

[草图编辑器]
!C = CATSKUSwitchEltTypeHdr             ; 构造/标准元素
; !3 = LowlightbackgroundHeader                        ; 低亮度背景
F5 = UsualVisu                        ; 常规
F6 = LowLightNoPick                        ; 低光度
^1 = USTHPoint                          ; 点过滤器
^2 = USTHCurve                          ; 曲线过滤器
^3 = USTHSurface                        ; 曲面过滤器


[创成式外形设计]
^!h = 仅当前几何体
F11 = CATShapeDesignInsertMode             ; 插入模式
^1 = USTHPoint                          ; 点过滤器
^2 = USTHCurve                          ; 曲线过滤器
^3 = USTHSurface                        ; 曲面过滤器

[工程制图]
!8 = 图纸背景
!7 = 工作视图

[Generative Sheetmetal Design]
